scripts_multiclock/results/ycsb_f/1-1/output.log
<_io.BytesIO object at 0x7fe282366a40> /home/ssd/yi/workloads/ycsb-0.15.0/bin/ycsb command database [options]
<_io.BytesIO object at 0x7fe282366a40> 
Commands:
<_io.BytesIO object at 0x7fe282366a40>     load           Execute the load phase
<_io.BytesIO object at 0x7fe282366a40>     run            Execute the transaction phase
<_io.BytesIO object at 0x7fe282366a40>     shell          Interactive mode
<_io.BytesIO object at 0x7fe282366a40> 
Databases:
<_io.BytesIO object at 0x7fe282366a40>     accumulo       https://github.com/brianfrankcooper/YCSB/tree/master/accumulo
<_io.BytesIO object at 0x7fe282366a40>     accumulo1.6    https://github.com/brianfrankcooper/YCSB/tree/master/accumulo1.6
<_io.BytesIO object at 0x7fe282366a40>     accumulo1.7    https://github.com/brianfrankcooper/YCSB/tree/master/accumulo1.7
<_io.BytesIO object at 0x7fe282366a40>     accumulo1.8    https://github.com/brianfrankcooper/YCSB/tree/master/accumulo1.8
<_io.BytesIO object at 0x7fe282366a40>     aerospike      https://github.com/brianfrankcooper/YCSB/tree/master/aerospike
<_io.BytesIO object at 0x7fe282366a40>     arangodb       https://github.com/brianfrankcooper/YCSB/tree/master/arangodb
<_io.BytesIO object at 0x7fe282366a40>     arangodb3      https://github.com/brianfrankcooper/YCSB/tree/master/arangodb3
<_io.BytesIO object at 0x7fe282366a40>     asynchbase     https://github.com/brianfrankcooper/YCSB/tree/master/asynchbase
<_io.BytesIO object at 0x7fe282366a40>     azuredocumentdb https://github.com/brianfrankcooper/YCSB/tree/master/azuredocumentdb
<_io.BytesIO object at 0x7fe282366a40>     azuretablestorage https://github.com/brianfrankcooper/YCSB/tree/master/azuretablestorage
<_io.BytesIO object at 0x7fe282366a40>     basic          https://github.com/brianfrankcooper/YCSB/tree/master/basic
<_io.BytesIO object at 0x7fe282366a40>     basicts        https://github.com/brianfrankcooper/YCSB/tree/master/basicts
<_io.BytesIO object at 0x7fe282366a40>     cassandra-cql  https://github.com/brianfrankcooper/YCSB/tree/master/cassandra
<_io.BytesIO object at 0x7fe282366a40>     cassandra2-cql https://github.com/brianfrankcooper/YCSB/tree/master/cassandra2
<_io.BytesIO object at 0x7fe282366a40>     cloudspanner   https://github.com/brianfrankcooper/YCSB/tree/master/cloudspanner
<_io.BytesIO object at 0x7fe282366a40>     couchbase      https://github.com/brianfrankcooper/YCSB/tree/master/couchbase
<_io.BytesIO object at 0x7fe282366a40>     couchbase2     https://github.com/brianfrankcooper/YCSB/tree/master/couchbase2
<_io.BytesIO object at 0x7fe282366a40>     dynamodb       https://github.com/brianfrankcooper/YCSB/tree/master/dynamodb
<_io.BytesIO object at 0x7fe282366a40>     elasticsearch  https://github.com/brianfrankcooper/YCSB/tree/master/elasticsearch
<_io.BytesIO object at 0x7fe282366a40>     elasticsearch5 https://github.com/brianfrankcooper/YCSB/tree/master/elasticsearch5
<_io.BytesIO object at 0x7fe282366a40>     foundationdb   https://github.com/brianfrankcooper/YCSB/tree/master/foundationdb
<_io.BytesIO object at 0x7fe282366a40>     geode          https://github.com/brianfrankcooper/YCSB/tree/master/geode
<_io.BytesIO object at 0x7fe282366a40>     googlebigtable https://github.com/brianfrankcooper/YCSB/tree/master/googlebigtable
<_io.BytesIO object at 0x7fe282366a40>     googledatastore https://github.com/brianfrankcooper/YCSB/tree/master/googledatastore
<_io.BytesIO object at 0x7fe282366a40>     hbase098       https://github.com/brianfrankcooper/YCSB/tree/master/hbase098
<_io.BytesIO object at 0x7fe282366a40>     hbase10        https://github.com/brianfrankcooper/YCSB/tree/master/hbase10
<_io.BytesIO object at 0x7fe282366a40>     hbase12        https://github.com/brianfrankcooper/YCSB/tree/master/hbase12
<_io.BytesIO object at 0x7fe282366a40>     hbase14        https://github.com/brianfrankcooper/YCSB/tree/master/hbase14
<_io.BytesIO object at 0x7fe282366a40>     hbase20        https://github.com/brianfrankcooper/YCSB/tree/master/hbase20
<_io.BytesIO object at 0x7fe282366a40>     hypertable     https://github.com/brianfrankcooper/YCSB/tree/master/hypertable
<_io.BytesIO object at 0x7fe282366a40>     ignite         https://github.com/brianfrankcooper/YCSB/tree/master/ignite
<_io.BytesIO object at 0x7fe282366a40>     ignite-sql     https://github.com/brianfrankcooper/YCSB/tree/master/ignite
<_io.BytesIO object at 0x7fe282366a40>     infinispan     https://github.com/brianfrankcooper/YCSB/tree/master/infinispan
<_io.BytesIO object at 0x7fe282366a40>     infinispan-cs  https://github.com/brianfrankcooper/YCSB/tree/master/infinispan
<_io.BytesIO object at 0x7fe282366a40>     jdbc           https://github.com/brianfrankcooper/YCSB/tree/master/jdbc
<_io.BytesIO object at 0x7fe282366a40>     kudu           https://github.com/brianfrankcooper/YCSB/tree/master/kudu
<_io.BytesIO object at 0x7fe282366a40>     maprdb         https://github.com/brianfrankcooper/YCSB/tree/master/maprdb
<_io.BytesIO object at 0x7fe282366a40>     maprjsondb     https://github.com/brianfrankcooper/YCSB/tree/master/maprjsondb
<_io.BytesIO object at 0x7fe282366a40>     memcached      https://github.com/brianfrankcooper/YCSB/tree/master/memcached
<_io.BytesIO object at 0x7fe282366a40>     mongodb        https://github.com/brianfrankcooper/YCSB/tree/master/mongodb
<_io.BytesIO object at 0x7fe282366a40>     mongodb-async  https://github.com/brianfrankcooper/YCSB/tree/master/mongodb
<_io.BytesIO object at 0x7fe282366a40>     nosqldb        https://github.com/brianfrankcooper/YCSB/tree/master/nosqldb
<_io.BytesIO object at 0x7fe282366a40>     orientdb       https://github.com/brianfrankcooper/YCSB/tree/master/orientdb
<_io.BytesIO object at 0x7fe282366a40>     rados          https://github.com/brianfrankcooper/YCSB/tree/master/rados
<_io.BytesIO object at 0x7fe282366a40>     redis          https://github.com/brianfrankcooper/YCSB/tree/master/redis
<_io.BytesIO object at 0x7fe282366a40>     rest           https://github.com/brianfrankcooper/YCSB/tree/master/rest
<_io.BytesIO object at 0x7fe282366a40>     riak           https://github.com/brianfrankcooper/YCSB/tree/master/riak
<_io.BytesIO object at 0x7fe282366a40>     rocksdb        https://github.com/brianfrankcooper/YCSB/tree/master/rocksdb
<_io.BytesIO object at 0x7fe282366a40>     s3             https://github.com/brianfrankcooper/YCSB/tree/master/s3
<_io.BytesIO object at 0x7fe282366a40>     solr           https://github.com/brianfrankcooper/YCSB/tree/master/solr
<_io.BytesIO object at 0x7fe282366a40>     solr6          https://github.com/brianfrankcooper/YCSB/tree/master/solr6
<_io.BytesIO object at 0x7fe282366a40>     tarantool      https://github.com/brianfrankcooper/YCSB/tree/master/tarantool
<_io.BytesIO object at 0x7fe282366a40> 
Options:
<_io.BytesIO object at 0x7fe282366a40>     -P file        Specify workload file
<_io.BytesIO object at 0x7fe282366a40>     -cp path       Additional Java classpath entries
<_io.BytesIO object at 0x7fe282366a40>     -jvm-args args Additional arguments to the JVM
<_io.BytesIO object at 0x7fe282366a40>     -p key=value   Override workload property
<_io.BytesIO object at 0x7fe282366a40>     -s             Print status to stderr
<_io.BytesIO object at 0x7fe282366a40>     -target n      Target ops/sec (default: unthrottled)
<_io.BytesIO object at 0x7fe282366a40>     -threads n     Number of client threads (default: 1)
<_io.BytesIO object at 0x7fe282366a40> 
Workload Files:
    There are various predefined workloads under workloads/ directory.
    See https://github.com/brianfrankcooper/YCSB/wiki/Core-Properties
    for the list of workload properties.
<_io.TextIOWrapper name='<stderr>' mode='w' encoding='UTF-8'> java -cp /home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/conf:/home/ssd/yi/workloads/ycsb-0.15.0/conf:/home/ssd/yi/workloads/ycsb-0.15.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/core-0.15.0.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/jackson-core-asl-1.9.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/lib/HdrHistogram-2.1.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/core-0.15.0.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/htrace-core4-4.1.0-incubating.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/log4j-1.2.17.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/spymemcached-2.11.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/memcached-binding-0.15.0.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/jackson-mapper-asl-1.9.13.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/jackson-core-asl-1.9.4.jar:/home/ssd/yi/workloads/ycsb-0.15.0/memcached-binding/lib/HdrHistogram-2.1.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MemcachedClient -s -P /home/ssd/yi/workloads/ycsb-0.15.0/workloads/workloadf -p memcached.hosts=127.0.0.1 -p memcached.port=11211 -p recordcount=1000000000 -p operationcount=125000000 -threads 112 -t[OVERALL], RunTime(ms), 477752
[OVERALL], Throughput(ops/sec), 261642.0234766155
[TOTAL_GCS_PS_Scavenge], Count, 3594
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 4633
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.9697499958137277
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 3594
[TOTAL_GC_TIME], Time(ms), 4633
[TOTAL_GC_TIME_%], Time(%), 0.9697499958137277
[READ], Operations, 125000000
[READ], AverageLatency(us), 268.33130848
[READ], MinLatency(us), 27
[READ], MaxLatency(us), 20895
[READ], 95thPercentileLatency(us), 495
[READ], 99thPercentileLatency(us), 511
[READ], Return=OK, 125000000
[UPDATE-FAILED], Operations, 62495414
[UPDATE-FAILED], AverageLatency(us), 272.54571837863176
[UPDATE-FAILED], MinLatency(us), 30
[UPDATE-FAILED], MaxLatency(us), 77439
[UPDATE-FAILED], 95thPercentileLatency(us), 497
[UPDATE-FAILED], 99thPercentileLatency(us), 514
[READ-MODIFY-WRITE], Operations, 62497088
[READ-MODIFY-WRITE], AverageLatency(us), 542.3562370617972
[READ-MODIFY-WRITE], MinLatency(us), 60
[READ-MODIFY-WRITE], MaxLatency(us), 100351
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 994
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1022
[CLEANUP], Operations, 112
[CLEANUP], AverageLatency(us), 579.875
[CLEANUP], MinLatency(us), 147
[CLEANUP], MaxLatency(us), 3477
[CLEANUP], 95thPercentileLatency(us), 1162
[CLEANUP], 99thPercentileLatency(us), 1703
[UPDATE], Operations, 1674
[UPDATE], AverageLatency(us), 299.2879330943847
[UPDATE], MinLatency(us), 44
[UPDATE], MaxLatency(us), 2923
[UPDATE], 95thPercentileLatency(us), 494
[UPDATE], 99thPercentileLatency(us), 511
[UPDATE], Return=ERROR, 62495414
[UPDATE], Return=OK, 1674